summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxScu_bf.h
/** \\brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.DRVP */
#define IFX_SCU_EVRSDCTRL2_DRVP_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.DRVP */
#define IFX_SCU_EVRSDCTRL2_DRVP_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.DRVP */
#define IFX_SCU_EVRSDCTRL2_DRVP_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.LCK */
#define IFX_SCU_EVRSDCTRL2_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.LCK */
#define IFX_SCU_EVRSDCTRL2_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.LCK */
#define IFX_SCU_EVRSDCTRL2_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.SDLUT */
#define IFX_SCU_EVRSDCTRL2_SDLUT_LEN (6)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.SDLUT */
#define IFX_SCU_EVRSDCTRL2_SDLUT_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.SDLUT */
#define IFX_SCU_EVRSDCTRL2_SDLUT_OFF (24)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.SDMINMAXDC */
#define IFX_SCU_EVRSDCTRL2_SDMINMAXDC_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.SDMINMAXDC */
#define IFX_SCU_EVRSDCTRL2_SDMINMAXDC_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.SDMINMAXDC */
#define IFX_SCU_EVRSDCTRL2_SDMINMAXDC_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL3_Bits.LCK */
#define IFX_SCU_EVRSDCTRL3_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL3_Bits.LCK */
#define IFX_SCU_EVRSDCTRL3_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL3_Bits.LCK */
#define IFX_SCU_EVRSDCTRL3_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL3_Bits.SDPID */
#define IFX_SCU_EVRSDCTRL3_SDPID_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL3_Bits.SDPID */
#define IFX_SCU_EVRSDCTRL3_SDPID_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL3_Bits.SDPID */
#define IFX_SCU_EVRSDCTRL3_SDPID_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL3_Bits.SDPWMPRE */
#define IFX_SCU_EVRSDCTRL3_SDPWMPRE_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL3_Bits.SDPWMPRE */
#define IFX_SCU_EVRSDCTRL3_SDPWMPRE_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL3_Bits.SDPWMPRE */
#define IFX_SCU_EVRSDCTRL3_SDPWMPRE_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL3_Bits.SDVOKLVL */
#define IFX_SCU_EVRSDCTRL3_SDVOKLVL_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL3_Bits.SDVOKLVL */
#define IFX_SCU_EVRSDCTRL3_SDVOKLVL_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL3_Bits.SDVOKLVL */
#define IFX_SCU_EVRSDCTRL3_SDVOKLVL_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL4_Bits.LCK */
#define IFX_SCU_EVRSDCTRL4_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL4_Bits.LCK */
#define IFX_SCU_EVRSDCTRL4_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL4_Bits.LCK */
#define IFX_SCU_EVRSDCTRL4_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL4_Bits.SYNCDIV */
#define IFX_SCU_EVRSDCTRL4_SYNCDIV_LEN (3)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL4_Bits.SYNCDIV */
#define IFX_SCU_EVRSDCTRL4_SYNCDIV_MSK (0x7)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL4_Bits.SYNCDIV */
#define IFX_SCU_EVRSDCTRL4_SYNCDIV_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.BGPROK */
#define IFX_SCU_EVRSTAT_BGPROK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.BGPROK */
#define IFX_SCU_EVRSTAT_BGPROK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.BGPROK */
#define IFX_SCU_EVRSTAT_BGPROK_OFF (10)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.EVR13 */
#define IFX_SCU_EVRSTAT_EVR13_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.EVR13 */
#define IFX_SCU_EVRSTAT_EVR13_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.EVR13 */
#define IFX_SCU_EVRSTAT_EVR13_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.EVR33 */
#define IFX_SCU_EVRSTAT_EVR33_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.EVR33 */
#define IFX_SCU_EVRSTAT_EVR33_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.EVR33 */
#define IFX_SCU_EVRSTAT_EVR33_OFF (2)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.EXTPASS13 */
#define IFX_SCU_EVRSTAT_EXTPASS13_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.EXTPASS13 */
#define IFX_SCU_EVRSTAT_EXTPASS13_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.EXTPASS13 */
#define IFX_SCU_EVRSTAT_EXTPASS13_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.EXTPASS33 */
#define IFX_SCU_EVRSTAT_EXTPASS33_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.EXTPASS33 */
#define IFX_SCU_EVRSTAT_EXTPASS33_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.EXTPASS33 */
#define IFX_SCU_EVRSTAT_EXTPASS33_OFF (9)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.OV13 */
#define IFX_SCU_EVRSTAT_OV13_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.OV13 */
#define IFX_SCU_EVRSTAT_OV13_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.OV13 */
#define IFX_SCU_EVRSTAT_OV13_OFF (1)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.OV33 */
#define IFX_SCU_EVRSTAT_OV33_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.OV33 */
#define IFX_SCU_EVRSTAT_OV33_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.OV33 */
#define IFX_SCU_EVRSTAT_OV33_OFF (3)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.OVSWD */
#define IFX_SCU_EVRSTAT_OVSWD_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.OVSWD */
#define IFX_SCU_EVRSTAT_OVSWD_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.OVSWD */
#define IFX_SCU_EVRSTAT_OVSWD_OFF (4)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.UV13 */
#define IFX_SCU_EVRSTAT_UV13_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.UV13 */
#define IFX_SCU_EVRSTAT_UV13_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.UV13 */
#define IFX_SCU_EVRSTAT_UV13_OFF (5)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.UV33 */
#define IFX_SCU_EVRSTAT_UV33_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.UV33 */
#define IFX_SCU_EVRSTAT_UV33_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.UV33 */
#define IFX_SCU_EVRSTAT_UV33_OFF (6)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.UVSWD */
#define IFX_SCU_EVRSTAT_UVSWD_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.UVSWD */
#define IFX_SCU_EVRSTAT_UVSWD_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.UVSWD */
#define IFX_SCU_EVRSTAT_UVSWD_OFF (7)

/** \\brief  Length for Ifx_SCU_EVRUVMON_Bits.EVR13UVVAL */
#define IFX_SCU_EVRUVMON_EVR13UVVAL_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRUVMON_Bits.EVR13UVVAL */
#define IFX_SCU_EVRUVMON_EVR13UVVAL_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRUVMON_Bits.EVR13UVVAL */
#define IFX_SCU_EVRUVMON_EVR13UVVAL_OFF (0)

