summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxScu_bf.h
/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.ESR1WKEN */
#define IFX_SCU_PMSWCR0_ESR1WKEN_OFF (1)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.LCK */
#define IFX_SCU_PMSWCR0_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.LCK */
#define IFX_SCU_PMSWCR0_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.LCK */
#define IFX_SCU_PMSWCR0_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.PINADFEN */
#define IFX_SCU_PMSWCR0_PINADFEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.PINADFEN */
#define IFX_SCU_PMSWCR0_PINADFEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.PINADFEN */
#define IFX_SCU_PMSWCR0_PINADFEN_OFF (10)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.PINAEDCON */
#define IFX_SCU_PMSWCR0_PINAEDCON_LEN (2)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.PINAEDCON */
#define IFX_SCU_PMSWCR0_PINAEDCON_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.PINAEDCON */
#define IFX_SCU_PMSWCR0_PINAEDCON_OFF (11)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.PINAWKEN */
#define IFX_SCU_PMSWCR0_PINAWKEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.PINAWKEN */
#define IFX_SCU_PMSWCR0_PINAWKEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.PINAWKEN */
#define IFX_SCU_PMSWCR0_PINAWKEN_OFF (2)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.PINBDFEN */
#define IFX_SCU_PMSWCR0_PINBDFEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.PINBDFEN */
#define IFX_SCU_PMSWCR0_PINBDFEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.PINBDFEN */
#define IFX_SCU_PMSWCR0_PINBDFEN_OFF (13)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.PINBEDCON */
#define IFX_SCU_PMSWCR0_PINBEDCON_LEN (2)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.PINBEDCON */
#define IFX_SCU_PMSWCR0_PINBEDCON_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.PINBEDCON */
#define IFX_SCU_PMSWCR0_PINBEDCON_OFF (14)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.PINBWKEN */
#define IFX_SCU_PMSWCR0_PINBWKEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.PINBWKEN */
#define IFX_SCU_PMSWCR0_PINBWKEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.PINBWKEN */
#define IFX_SCU_PMSWCR0_PINBWKEN_OFF (3)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.PORSTDF */
#define IFX_SCU_PMSWCR0_PORSTDF_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.PORSTDF */
#define IFX_SCU_PMSWCR0_PORSTDF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.PORSTDF */
#define IFX_SCU_PMSWCR0_PORSTDF_OFF (23)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.SCRCLKSEL */
#define IFX_SCU_PMSWCR0_SCRCLKSEL_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.SCRCLKSEL */
#define IFX_SCU_PMSWCR0_SCRCLKSEL_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.SCRCLKSEL */
#define IFX_SCU_PMSWCR0_SCRCLKSEL_OFF (19)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.SCREN */
#define IFX_SCU_PMSWCR0_SCREN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.SCREN */
#define IFX_SCU_PMSWCR0_SCREN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.SCREN */
#define IFX_SCU_PMSWCR0_SCREN_OFF (16)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.SCRWKEN */
#define IFX_SCU_PMSWCR0_SCRWKEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.SCRWKEN */
#define IFX_SCU_PMSWCR0_SCRWKEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.SCRWKEN */
#define IFX_SCU_PMSWCR0_SCRWKEN_OFF (20)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.STBYRAMSEL */
#define IFX_SCU_PMSWCR0_STBYRAMSEL_LEN (2)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.STBYRAMSEL */
#define IFX_SCU_PMSWCR0_STBYRAMSEL_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.STBYRAMSEL */
#define IFX_SCU_PMSWCR0_STBYRAMSEL_OFF (17)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.TRISTEN */
#define IFX_SCU_PMSWCR0_TRISTEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.TRISTEN */
#define IFX_SCU_PMSWCR0_TRISTEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.TRISTEN */
#define IFX_SCU_PMSWCR0_TRISTEN_OFF (21)

/** \\brief  Length for Ifx_SCU_PMSWCR0_Bits.TRISTREQ */
#define IFX_SCU_PMSWCR0_TRISTREQ_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR0_Bits.TRISTREQ */
#define IFX_SCU_PMSWCR0_TRISTREQ_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR0_Bits.TRISTREQ */
#define IFX_SCU_PMSWCR0_TRISTREQ_OFF (22)

/** \\brief  Length for Ifx_SCU_PMSWCR1_Bits.CPUIDLSEL */
#define IFX_SCU_PMSWCR1_CPUIDLSEL_LEN (3)

/** \\brief  Mask for Ifx_SCU_PMSWCR1_Bits.CPUIDLSEL */
#define IFX_SCU_PMSWCR1_CPUIDLSEL_MSK (0x7)

/** \\brief  Offset for Ifx_SCU_PMSWCR1_Bits.CPUIDLSEL */
#define IFX_SCU_PMSWCR1_CPUIDLSEL_OFF (8)

/** \\brief  Length for Ifx_SCU_PMSWCR1_Bits.CPUSEL */
#define IFX_SCU_PMSWCR1_CPUSEL_LEN (3)

/** \\brief  Mask for Ifx_SCU_PMSWCR1_Bits.CPUSEL */
#define IFX_SCU_PMSWCR1_CPUSEL_MSK (0x7)

/** \\brief  Offset for Ifx_SCU_PMSWCR1_Bits.CPUSEL */
#define IFX_SCU_PMSWCR1_CPUSEL_OFF (24)

/** \\brief  Length for Ifx_SCU_PMSWCR1_Bits.IRADIS */
#define IFX_SCU_PMSWCR1_IRADIS_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR1_Bits.IRADIS */
#define IFX_SCU_PMSWCR1_IRADIS_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR1_Bits.IRADIS */
#define IFX_SCU_PMSWCR1_IRADIS_OFF (12)

/** \\brief  Length for Ifx_SCU_PMSWCR1_Bits.LCK */
#define IFX_SCU_PMSWCR1_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR1_Bits.LCK */
#define IFX_SCU_PMSWCR1_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR1_Bits.LCK */
#define IFX_SCU_PMSWCR1_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_PMSWCR1_Bits.SCRCFG */
#define IFX_SCU_PMSWCR1_SCRCFG_LEN (8)

/** \\brief  Mask for Ifx_SCU_PMSWCR1_Bits.SCRCFG */
#define IFX_SCU_PMSWCR1_SCRCFG_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_PMSWCR1_Bits.SCRCFG */
#define IFX_SCU_PMSWCR1_SCRCFG_OFF (16)

/** \\brief  Length for Ifx_SCU_PMSWCR1_Bits.SCRSTEN */
#define IFX_SCU_PMSWCR1_SCRSTEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR1_Bits.SCRSTEN */
#define IFX_SCU_PMSWCR1_SCRSTEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR1_Bits.SCRSTEN */
#define IFX_SCU_PMSWCR1_SCRSTEN_OFF (0)

/** \\brief  Length for Ifx_SCU_PMSWCR1_Bits.SCRSTREQ */
#define IFX_SCU_PMSWCR1_SCRSTREQ_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR1_Bits.SCRSTREQ */
#define IFX_SCU_PMSWCR1_SCRSTREQ_MSK (0x1)

