summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxScu_bf.h
/** \\brief  Offset for Ifx_SCU_PMSWCR1_Bits.SCRSTREQ */
#define IFX_SCU_PMSWCR1_SCRSTREQ_OFF (1)

/** \\brief  Length for Ifx_SCU_PMSWCR1_Bits.STBYEV */
#define IFX_SCU_PMSWCR1_STBYEV_LEN (3)

/** \\brief  Mask for Ifx_SCU_PMSWCR1_Bits.STBYEV */
#define IFX_SCU_PMSWCR1_STBYEV_MSK (0x7)

/** \\brief  Offset for Ifx_SCU_PMSWCR1_Bits.STBYEV */
#define IFX_SCU_PMSWCR1_STBYEV_OFF (28)

/** \\brief  Length for Ifx_SCU_PMSWCR1_Bits.STBYEVEN */
#define IFX_SCU_PMSWCR1_STBYEVEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR1_Bits.STBYEVEN */
#define IFX_SCU_PMSWCR1_STBYEVEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR1_Bits.STBYEVEN */
#define IFX_SCU_PMSWCR1_STBYEVEN_OFF (27)

/** \\brief  Length for Ifx_SCU_PMSWCR2_Bits.BUSY */
#define IFX_SCU_PMSWCR2_BUSY_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR2_Bits.BUSY */
#define IFX_SCU_PMSWCR2_BUSY_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR2_Bits.BUSY */
#define IFX_SCU_PMSWCR2_BUSY_OFF (8)

/** \\brief  Length for Ifx_SCU_PMSWCR2_Bits.LCK */
#define IFX_SCU_PMSWCR2_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR2_Bits.LCK */
#define IFX_SCU_PMSWCR2_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR2_Bits.LCK */
#define IFX_SCU_PMSWCR2_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_PMSWCR2_Bits.RST */
#define IFX_SCU_PMSWCR2_RST_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR2_Bits.RST */
#define IFX_SCU_PMSWCR2_RST_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR2_Bits.RST */
#define IFX_SCU_PMSWCR2_RST_OFF (26)

/** \\brief  Length for Ifx_SCU_PMSWCR2_Bits.SCRECC */
#define IFX_SCU_PMSWCR2_SCRECC_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR2_Bits.SCRECC */
#define IFX_SCU_PMSWCR2_SCRECC_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR2_Bits.SCRECC */
#define IFX_SCU_PMSWCR2_SCRECC_OFF (9)

/** \\brief  Length for Ifx_SCU_PMSWCR2_Bits.SCRINT */
#define IFX_SCU_PMSWCR2_SCRINT_LEN (8)

/** \\brief  Mask for Ifx_SCU_PMSWCR2_Bits.SCRINT */
#define IFX_SCU_PMSWCR2_SCRINT_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_PMSWCR2_Bits.SCRINT */
#define IFX_SCU_PMSWCR2_SCRINT_OFF (0)

/** \\brief  Length for Ifx_SCU_PMSWCR2_Bits.SCRRST */
#define IFX_SCU_PMSWCR2_SCRRST_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR2_Bits.SCRRST */
#define IFX_SCU_PMSWCR2_SCRRST_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR2_Bits.SCRRST */
#define IFX_SCU_PMSWCR2_SCRRST_OFF (11)

/** \\brief  Length for Ifx_SCU_PMSWCR2_Bits.SCRWDT */
#define IFX_SCU_PMSWCR2_SCRWDT_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR2_Bits.SCRWDT */
#define IFX_SCU_PMSWCR2_SCRWDT_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR2_Bits.SCRWDT */
#define IFX_SCU_PMSWCR2_SCRWDT_OFF (10)

/** \\brief  Length for Ifx_SCU_PMSWCR2_Bits.SMURST */
#define IFX_SCU_PMSWCR2_SMURST_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR2_Bits.SMURST */
#define IFX_SCU_PMSWCR2_SMURST_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR2_Bits.SMURST */
#define IFX_SCU_PMSWCR2_SMURST_OFF (25)

/** \\brief  Length for Ifx_SCU_PMSWCR2_Bits.TCINT */
#define IFX_SCU_PMSWCR2_TCINT_LEN (8)

/** \\brief  Mask for Ifx_SCU_PMSWCR2_Bits.TCINT */
#define IFX_SCU_PMSWCR2_TCINT_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_PMSWCR2_Bits.TCINT */
#define IFX_SCU_PMSWCR2_TCINT_OFF (16)

/** \\brief  Length for Ifx_SCU_PMSWCR2_Bits.TCINTREQ */
#define IFX_SCU_PMSWCR2_TCINTREQ_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWCR2_Bits.TCINTREQ */
#define IFX_SCU_PMSWCR2_TCINTREQ_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWCR2_Bits.TCINTREQ */
#define IFX_SCU_PMSWCR2_TCINTREQ_OFF (24)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.ESR0TRIST */
#define IFX_SCU_PMSWSTAT_ESR0TRIST_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.ESR0TRIST */
#define IFX_SCU_PMSWSTAT_ESR0TRIST_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.ESR0TRIST */
#define IFX_SCU_PMSWSTAT_ESR0TRIST_OFF (27)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.ESR1OVRUN */
#define IFX_SCU_PMSWSTAT_ESR1OVRUN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.ESR1OVRUN */
#define IFX_SCU_PMSWSTAT_ESR1OVRUN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.ESR1OVRUN */
#define IFX_SCU_PMSWSTAT_ESR1OVRUN_OFF (3)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.ESR1WKEN */
#define IFX_SCU_PMSWSTAT_ESR1WKEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.ESR1WKEN */
#define IFX_SCU_PMSWSTAT_ESR1WKEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.ESR1WKEN */
#define IFX_SCU_PMSWSTAT_ESR1WKEN_OFF (20)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.ESR1WKP */
#define IFX_SCU_PMSWSTAT_ESR1WKP_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.ESR1WKP */
#define IFX_SCU_PMSWSTAT_ESR1WKP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.ESR1WKP */
#define IFX_SCU_PMSWSTAT_ESR1WKP_OFF (2)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.HWCFGEVR */
#define IFX_SCU_PMSWSTAT_HWCFGEVR_LEN (3)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.HWCFGEVR */
#define IFX_SCU_PMSWSTAT_HWCFGEVR_MSK (0x7)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.HWCFGEVR */
#define IFX_SCU_PMSWSTAT_HWCFGEVR_OFF (10)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINAOVRUN */
#define IFX_SCU_PMSWSTAT_PINAOVRUN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINAOVRUN */
#define IFX_SCU_PMSWSTAT_PINAOVRUN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PINAOVRUN */
#define IFX_SCU_PMSWSTAT_PINAOVRUN_OFF (5)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINAWKEN */
#define IFX_SCU_PMSWSTAT_PINAWKEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINAWKEN */
#define IFX_SCU_PMSWSTAT_PINAWKEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PINAWKEN */
#define IFX_SCU_PMSWSTAT_PINAWKEN_OFF (21)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINAWKP */
#define IFX_SCU_PMSWSTAT_PINAWKP_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINAWKP */
#define IFX_SCU_PMSWSTAT_PINAWKP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PINAWKP */
#define IFX_SCU_PMSWSTAT_PINAWKP_OFF (4)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINBOVRUN */
#define IFX_SCU_PMSWSTAT_PINBOVRUN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINBOVRUN */
#define IFX_SCU_PMSWSTAT_PINBOVRUN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PINBOVRUN */
#define IFX_SCU_PMSWSTAT_PINBOVRUN_OFF (7)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINBWKEN */
#define IFX_SCU_PMSWSTAT_PINBWKEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINBWKEN */
#define IFX_SCU_PMSWSTAT_PINBWKEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PINBWKEN */
#define IFX_SCU_PMSWSTAT_PINBWKEN_OFF (22)

