summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxScu_bf.h
/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINBWKP */
#define IFX_SCU_PMSWSTAT_PINBWKP_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINBWKP */
#define IFX_SCU_PMSWSTAT_PINBWKP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PINBWKP */
#define IFX_SCU_PMSWSTAT_PINBWKP_OFF (6)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.PORSTDF */
#define IFX_SCU_PMSWSTAT_PORSTDF_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PORSTDF */
#define IFX_SCU_PMSWSTAT_PORSTDF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PORSTDF */
#define IFX_SCU_PMSWSTAT_PORSTDF_OFF (9)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.SCR */
#define IFX_SCU_PMSWSTAT_SCR_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.SCR */
#define IFX_SCU_PMSWSTAT_SCR_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.SCR */
#define IFX_SCU_PMSWSTAT_SCR_OFF (18)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.SCRST */
#define IFX_SCU_PMSWSTAT_SCRST_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.SCRST */
#define IFX_SCU_PMSWSTAT_SCRST_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.SCRST */
#define IFX_SCU_PMSWSTAT_SCRST_OFF (16)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.SCRWKEN */
#define IFX_SCU_PMSWSTAT_SCRWKEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.SCRWKEN */
#define IFX_SCU_PMSWSTAT_SCRWKEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.SCRWKEN */
#define IFX_SCU_PMSWSTAT_SCRWKEN_OFF (19)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.SCRWKP */
#define IFX_SCU_PMSWSTAT_SCRWKP_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.SCRWKP */
#define IFX_SCU_PMSWSTAT_SCRWKP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.SCRWKP */
#define IFX_SCU_PMSWSTAT_SCRWKP_OFF (17)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.STBYRAM */
#define IFX_SCU_PMSWSTAT_STBYRAM_LEN (2)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.STBYRAM */
#define IFX_SCU_PMSWSTAT_STBYRAM_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.STBYRAM */
#define IFX_SCU_PMSWSTAT_STBYRAM_OFF (13)

/** \\brief  Length for Ifx_SCU_PMSWSTAT_Bits.TRIST */
#define IFX_SCU_PMSWSTAT_TRIST_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTAT_Bits.TRIST */
#define IFX_SCU_PMSWSTAT_TRIST_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTAT_Bits.TRIST */
#define IFX_SCU_PMSWSTAT_TRIST_OFF (15)

/** \\brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.ESR1OVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_ESR1OVRUNCLR_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.ESR1OVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_ESR1OVRUNCLR_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.ESR1OVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_ESR1OVRUNCLR_OFF (3)

/** \\brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.ESR1WKPCLR */
#define IFX_SCU_PMSWSTATCLR_ESR1WKPCLR_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.ESR1WKPCLR */
#define IFX_SCU_PMSWSTATCLR_ESR1WKPCLR_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.ESR1WKPCLR */
#define IFX_SCU_PMSWSTATCLR_ESR1WKPCLR_OFF (2)

/** \\brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.PINAOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_PINAOVRUNCLR_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.PINAOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_PINAOVRUNCLR_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.PINAOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_PINAOVRUNCLR_OFF (5)

/** \\brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.PINAWKPCLR */
#define IFX_SCU_PMSWSTATCLR_PINAWKPCLR_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.PINAWKPCLR */
#define IFX_SCU_PMSWSTATCLR_PINAWKPCLR_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.PINAWKPCLR */
#define IFX_SCU_PMSWSTATCLR_PINAWKPCLR_OFF (4)

/** \\brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.PINBOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_PINBOVRUNCLR_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.PINBOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_PINBOVRUNCLR_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.PINBOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_PINBOVRUNCLR_OFF (7)

/** \\brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.PINBWKPCLR */
#define IFX_SCU_PMSWSTATCLR_PINBWKPCLR_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.PINBWKPCLR */
#define IFX_SCU_PMSWSTATCLR_PINBWKPCLR_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.PINBWKPCLR */
#define IFX_SCU_PMSWSTATCLR_PINBWKPCLR_OFF (6)

/** \\brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.SCRSTCLR */
#define IFX_SCU_PMSWSTATCLR_SCRSTCLR_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.SCRSTCLR */
#define IFX_SCU_PMSWSTATCLR_SCRSTCLR_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.SCRSTCLR */
#define IFX_SCU_PMSWSTATCLR_SCRSTCLR_OFF (16)

/** \\brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.SCRWKPCLR */
#define IFX_SCU_PMSWSTATCLR_SCRWKPCLR_LEN (1)

/** \\brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.SCRWKPCLR */
#define IFX_SCU_PMSWSTATCLR_SCRWKPCLR_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.SCRWKPCLR */
#define IFX_SCU_PMSWSTATCLR_SCRWKPCLR_OFF (17)

/** \\brief  Length for Ifx_SCU_RSTCON2_Bits.CLRC */
#define IFX_SCU_RSTCON2_CLRC_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTCON2_Bits.CLRC */
#define IFX_SCU_RSTCON2_CLRC_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTCON2_Bits.CLRC */
#define IFX_SCU_RSTCON2_CLRC_OFF (1)

/** \\brief  Length for Ifx_SCU_RSTCON2_Bits.CSS0 */
#define IFX_SCU_RSTCON2_CSS0_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTCON2_Bits.CSS0 */
#define IFX_SCU_RSTCON2_CSS0_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTCON2_Bits.CSS0 */
#define IFX_SCU_RSTCON2_CSS0_OFF (12)

/** \\brief  Length for Ifx_SCU_RSTCON2_Bits.CSS1 */
#define IFX_SCU_RSTCON2_CSS1_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTCON2_Bits.CSS1 */
#define IFX_SCU_RSTCON2_CSS1_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_RSTCON2_Bits.CSS1 */
#define IFX_SCU_RSTCON2_CSS1_OFF (13)

/** \\brief  Length for Ifx_SCU_RSTCON2_Bits.CSS2 */
#define IFX_SCU_RSTCON2_CSS2_LEN (1)

/** \\brief  Mask for Ifx_SCU_RSTCON2_Bits.CSS2 */
#define IFX_SCU_RSTCON2_CSS2_MSK (0x1)

